src/cf/Catalogs/пбп_ИнтеграционныеПотоки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>пбп_ИнтеграционныеПотоки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзмененВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючРегламентногоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейХранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейХраненияОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пбп_НаправленияИнтеграционныхПотоков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_НастройкиИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскаяФункция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ПользовательскиеФункции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаВхода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьНомераВерсий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВхода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.пбп_ТипыJSON</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрURL</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/пбп_ИнтеграционныеПотоки/Ext/ObjectModule.bsl
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоНовый()
		И пбп_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеКонстанты("пбп_ИспользоватьПользовательскиеФункции")
		И ПустаяСтрока(КлючРегламентногоЗадания) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
		|	пбп_ИнтеграционныеПотоки.ПользовательскаяФункция КАК ПользовательскаяФункция,
		|	пбп_ИнтеграционныеПотоки.НастройкаИнтеграции КАК НастройкаИнтеграции
		|ИЗ
		|	Справочник.пбп_ИнтеграционныеПотоки КАК пбп_ИнтеграционныеПотоки
		|ГДЕ
		|	пбп_ИнтеграционныеПотоки.Ссылка = &Ссылка";
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
		
		ПользовательскаяФункцияДоИзменения = Справочники.пбп_ПользовательскиеФункции.ПустаяСсылка();
		НастройкаИнтеграцииДоИзменения = Справочники.пбп_НастройкиИнтеграции.ПустаяСсылка();
		Если ВыборкаРезультатаЗапроса.Следующий() Тогда
			ПользовательскаяФункцияДоИзменения = ВыборкаРезультатаЗапроса.ПользовательскаяФункция;
			НастройкаИнтеграцииДоИзменения = ВыборкаРезультатаЗапроса.НастройкаИнтеграции;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПользовательскаяФункцияДоИзменения)
			И Не ЗначениеЗаполнено(ПользовательскаяФункция) Тогда
			УдалитьРегламентноеЗаданиеПоКлючу(Истина);
		КонецЕсли;
		
		ФункцияИзменена = ЗначениеЗаполнено(ПользовательскаяФункцияДоИзменения) И ЗначениеЗаполнено(ПользовательскаяФункция)
			И ПользовательскаяФункцияДоИзменения <> ПользовательскаяФункция;
		НастройкаИзменена = ЗначениеЗаполнено(НастройкаИнтеграцииДоИзменения) И ЗначениеЗаполнено(НастройкаИнтеграции)
			И НастройкаИнтеграцииДоИзменения <> НастройкаИнтеграции;
		Если ФункцияИзменена Или НастройкаИзменена Тогда
			ОбновитьПараметрыРегламентногоЗадания();
		КонецЕсли;
	КонецЕсли;
	
	// пбп_ПредопределенныеЗначения
	пбп_ПредопределенныеЗначения.ПередЗаписью(ЭтотОбъект, Отказ);
	// Конец пбп_ПредопределенныеЗначения
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// пбп_ПредопределенныеЗначения
	пбп_ПредопределенныеЗначения.ПриЗаписи(ЭтотОбъект, Отказ);
	// Конец пбп_ПредопределенныеЗначения
	
	Если ПометкаУдаления И Не ПустаяСтрока(КлючРегламентногоЗадания) Тогда
		УдалитьРегламентноеЗаданиеПоКлючу(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьПараметрыРегламентногоЗадания()
	
	ОтборЗадания = Новый Структура;
	ОтборЗадания.Вставить("Ключ", ПолучитьУникальныйИдентификаторТекущейНастройки());
	МассивРегламентныхЗаданий = пбп_Переадресация.НайтиЗадания(ОтборЗадания);
	
	Если МассивРегламентныхЗаданий.Количество() Тогда
		РегламентноеЗадание = МассивРегламентныхЗаданий[0];
		
		ПараметрыРегламентногоЗадания = Новый Массив;
		ПараметрыРегламентногоЗадания.Добавить(НастройкаИнтеграции);
		ПараметрыРегламентногоЗадания.Добавить(ПользовательскаяФункция);
		
		РегламентноеЗадание.Параметры = ПараметрыРегламентногоЗадания;
		РегламентноеЗадание.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьРегламентноеЗаданиеПоКлючу(ПользовательскаяФункция)
	
	Если ПользовательскаяФункция Тогда
		ОтборЗадания = Новый Структура;
		ОтборЗадания.Вставить("Ключ", ПолучитьУникальныйИдентификаторТекущейНастройки());
		МассивРегламентныхЗаданий = пбп_Переадресация.НайтиЗадания(ОтборЗадания);
		
		Если МассивРегламентныхЗаданий.Количество() Тогда
			РегламентноеЗадание = МассивРегламентныхЗаданий[0];
			пбп_Переадресация.УдалитьЗадание(РегламентноеЗадание.УникальныйИдентификатор);
		КонецЕсли;
	Иначе
		ДанныеРеглЗадания = Неопределено;
		Если Метаданные.РегламентныеЗадания.Найти(КлючРегламентногоЗадания) <> Неопределено Тогда
			ДанныеРеглЗадания = Метаданные.РегламентныеЗадания[КлючРегламентногоЗадания];
		КонецЕсли;
		
		Если ДанныеРеглЗадания = Неопределено Тогда
			ОтборЗадания = Новый Структура;
			ОтборЗадания.Вставить("Ключ", ПолучитьУникальныйИдентификаторТекущейНастройки());
		Иначе
			ОтборЗадания = Новый Структура;
			Если ДанныеРеглЗадания.Предопределенное Тогда
				ОтборЗадания.Вставить("Наименование"	, ДанныеРеглЗадания.Наименование);
				ОтборЗадания.Вставить("Предопределенное", Истина);
			Иначе
				ОтборЗадания.Вставить("Ключ", ПолучитьУникальныйИдентификаторТекущейНастройки());
			КонецЕсли;
		КонецЕсли;
		
		МассивРегламентныхЗаданий = пбп_Переадресация.НайтиЗадания(ОтборЗадания);
		
		Если МассивРегламентныхЗаданий.Количество() Тогда
			// Для предопределенного восстанавливаем настройки из конфигуратора
			Если ДанныеРеглЗадания.Предопределенное Тогда
				РегламентноеЗадание = МассивРегламентныхЗаданий[0];
				РегламентноеЗадание.Использование	= ДанныеРеглЗадания.Использование;
				Если ДанныеРеглЗадания.Расписание <> Неопределено Тогда
					РегламентноеЗадание.Расписание	= ДанныеРеглЗадания.Расписание;
				Иначе
					РегламентноеЗадание.Расписание	= Новый РасписаниеРегламентногоЗадания;
				КонецЕсли;
				РегламентноеЗадание.Записать();
			Иначе
				РегламентноеЗадание = МассивРегламентныхЗаданий[0];
				пбп_Переадресация.УдалитьЗадание(РегламентноеЗадание.УникальныйИдентификатор);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьУникальныйИдентификаторТекущейНастройки()
	
	Возврат Строка(Ссылка.УникальныйИдентификатор());
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункцкии

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
